package part_1;

//Вывести на экран соответствий между символами и их численными обозначениями в памяти компьютера.
public class Task_17 {
    public static void main(String[] args) {
        char a = 'S';
        int b = a;
        System.out.println(b);
    }
}
